Revit 2024 API
BuiltInFailures.LinkFailures.LinkedFileOpenInOtherDoc Property
 Linked file cannot be reloaded because it is loaded into another open document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LinkedFileOpenInOtherDoc { get; }
Visual Basic
Public Shared ReadOnly Property LinkedFileOpenInOtherDoc As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LinkedFileOpenInOtherDoc {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace